[
  {
    "path": "posts/2021-07-11-isss608-assignment-1/",
    "title": "ISSS608 Assignment 1",
    "description": "This post is a submission for ISSS608 Assignment 1, Vast Challenge 2",
    "author": [
      {
        "name": "Yeo Chia Guan Andy",
        "url": {}
      }
    ],
    "date": "2021-07-25",
    "categories": [],
    "contents": "\r\n#VAST Challenge 2\r\n#Content\r\n1.0 Literature Review\r\n2.0 Insights\r\n2.1 Credit Card and Loyalty Card Transactions\r\n2.1.1 Loyalty Card Usage\r\n2.1.2 Credit Card Usage\r\n\r\n2.2 Visitor per location by day\r\n2.2.1 Loyalty Card\r\n2.2.2 Credit Card\r\n\r\n2.3 Total Visits per Store\r\n\r\n3.0 Georeferencing\r\n4.0 Inferences\r\n4.1 Merging Car and GPS Dataset\r\n[# 4.2 Finding Patterns from Patronage and Vehicle Data ]\r\n\r\n5.0 Future Works\r\n1.0 Literature Review\r\nFor the literature review, a sample entry was taken from GitHub on a team who participated in the VAST Challenge 2014, Mini Challenge 2. The team of two was from City University London who performed their analysis using processing and libraries giCentre Utils and geoMap which were written by the giCentre at City University London.\r\nThe team used a map to indicate the coordinates of each vehicle at any point in time using animation. Locations outside of the norm were highlighted to find that there were five unknown locations visited by four security employees.\r\nA possible gap to the for this study would be to identify the credit card owners by inferencing the vehicle dataset with the credit card dataset.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n2.0 Insights\r\n2.1 Credit Card and Loyalty Card Transactions\r\nUsing the loyalty card and credit card data, we first explore the popularity of shops by counting the number of visits by location. It was found that Katerina’s Cafe and Hippokampos were the top 2 most popular shops in terms of the transactions made over the period from 6 Jan to 19 Jan 2014.\r\n2.1.1 Loyalty Card Usage\r\n\r\npreservec6071f68cf918fe0\r\n\r\n2.1.2 Credit Card Usage\r\n\r\npreserve1552cd77ba54df27\r\n\r\n2.2 Visitor per location by day\r\nNext, we next plot the visitor count by day for each location to identify possible trends. It was also observed that at least 10 vehicles will visit Brew’ve Been Served every weekday.\r\nOn the credit card data, it was noticed that there was 1 visit to the Daily Dealz and 1 visit to U-pump which were out of the normal pattern. The visit to the Daily Dealz was not captured in the loyalty data, hence it can be inferred that the loyalty card might not be applicable for that store.\r\nThe data on loyalty card usage collects the date used but not the time, hence it is recommended that the time be collected as well to correctly match the credit card owner and the loyalty card owner to identify the card user.\r\n2.2.1 Loyalty Card\r\n\r\npreserve761155b943682b2f\r\n\r\n2.2.2 Credit Card\r\n\r\npreservea256c29c58751640\r\n\r\nNext we look at merging the credit card data with the loyalty card data to identify their relationship.As the exact transaction time was not recorded for the loyalty card, we draw relationship between the credit card and the loyalty card using the date, location and price variables. The left-join method was applied as payment is assumed compulsory by credit card for each transaction while the use of a loyalty card is optional, hence there might be credit card transactions without the use of a loyalty card which was apparent in the chart above as there were more visits recorded for the credit card data when compared to the loyalty card data. The credit card number should also be consistent with the loyalty card number as both should belong to the same owner.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nThe data was grouped by location in which Katerina’s Cafe was found the be the most popular location with 214 visitors, followed by Hippokampos with 173 visitors.\r\nThis was an anomaly as the credit card data only showed 212 visitors for Katerina’s Cafe and 171 for Hippokampos.\r\n2.3 Total Visits per Store\r\n\r\npreserve33e50cda6ad6779f\r\n\r\nTo address the anomaly, we compare the Patronage dataset with the credit card data. We filter the transactions which were made using a credit card and loyalty card to identify the cause of the anomaly.\r\nIn this regard, we found that several credit card transactions had more than 1 loyalty card applied. We see that credit card numbers 1286,4795,4948,5368,5921,7889 and 8332 made transactions with more than 1 loyalty card.\r\nThis could imply that there was a meet-up between different employees of GasTech at those locations where a colleague might have used his loyalty card to obtain the benefits from the store.\r\n\r\n# A tibble: 7 x 2\r\n  `unique(last4ccnum)` UniqueLoyalty\r\n  <chr>                        <int>\r\n1 1286                             2\r\n2 4795                             2\r\n3 4948                             2\r\n4 5368                             2\r\n5 5921                             2\r\n6 7889                             2\r\n7 8332                             2\r\n\r\nUsing the interactive datatable, we could identify the transactions made with the above credit card numbers. It was found that the occurrences of using a different loyalty card were more than one.\r\n\r\npreserve82ae6c2ae16df129\r\n\r\n3.0 Georeferencing\r\nFor the Mini Challenge, we were given a jpg file of the Akila, Kronos Map which we would use as the background for the locations. To use the geospatial data, we will need to georeference the points on the map image using GIF softwares such as QGIS. For this assignment, the QGIS software was used and to map the points of the shape file to the image file.\r\nFirst, we were given the Abila.shp file which contained the map information which could be opened in the QGIS application as shown below.\r\n\r\nNext, to make the map useful, we merge the map data to the given image data using georeferencer to indicate the points on the map to the coordinates on the image.\r\n\r\nFinally, we apply the georeference to get the final output as shwon below.\r\n\r\n\r\n\r\n\r\n\r\nReading layer `Abila' from data source \r\n  `C:\\yeochiaguan\\VAST Challenge\\_posts\\2021-07-11-isss608-assignment-1\\data\\Geospatial' \r\n  using driver `ESRI Shapefile'\r\nSimple feature collection with 3290 features and 9 fields\r\nGeometry type: LINESTRING\r\nDimension:     XY\r\nBounding box:  xmin: 24.82401 ymin: 36.04502 xmax: 24.90997 ymax: 36.09492\r\nGeodetic CRS:  WGS 84\r\n\r\n4.0 Inferences\r\n4.1 Merging Car and GPS Dataset\r\nNext, we merge the gps and car datasets to which contains the vehicle data to identify owners and the trips made by each vehicle during the period between 6 Jan 2014 and 19 Jan 2014.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nWe are interested to know which employee visited the shops and made those transactions, however, available information on both datasets are very limited as we only have the timestamp to possibly match the vehicle dataset with the patronage dataset. Even the credit card dataset could only record to the minute, while gps data had a higher resolution to the second.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nWe start off by plotting the route taken by each employee for each day.\r\n\r\npreserve92c7bf0eea492026\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\npreserve815bd39ed75ce2c3\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nWhen we group the vehicle data by employment title, we could determine the normal route which each employee would take. From the chart below, we could see the following “unique” paths taken which were out of the norm. These paths can be identified by the weight of the lines which represents the frequency in which the path was taken.\r\n\r\npreserve61737628fd1c2a31\r\n\r\nS/N\r\nID\r\nCurrent Employment Title\r\nRemarks\r\n1\r\n22\r\nBadging Office\r\n1 Trip through Ermou Street\r\n2\r\n20\r\nBuilding Control\r\n1 Trip through coffee Chameleon\r\n3\r\n26\r\nDrill Site Manager\r\n1 trip through Androutsu Street and 1 trip around Carnero Street\r\n4\r\n28\r\nDrill Technician\r\nFor id 28, data is not usable. For id 7, there was a trip near Spetson Street\r\n5\r\n3\r\nEngineer\r\n1 trip near Pilau Street\r\n6\r\n14\r\nEngineering Group Manager\r\n1 trip aound Carnero Street\r\n7\r\n35\r\nEnvironmental Safety Adviser\r\n1 trip near Parla Street and 1 trip near Arkadiou Street\r\n8\r\n29\r\nFacilities Group Manager\r\n1 trip past Hallowed Grounds and 1 trip past Carlyle Chemical Inc.\r\n9\r\n25\r\nGeologist\r\n1 trip past Alberts Fine Clothing\r\n10\r\n19\r\nHydraulic Technician\r\n1 trip past Coffee Shack\r\nWhen we look at the pathings by Employment Type, we see a different picture. As observed below, the Employment Type “Missing”, which represents trucks (as identified with id > 100), showed a peculiar route taken. Vehicle ID 107 could be seen travelling pass Pilau Park to Velestinou Boulevard. Vehicle ID 29 from Facilities could also be seen travelling to unique places during the period.\r\n\r\npreserveeeb12dcb8506e4e8\r\n\r\n4.2 Finding Patterns from Patronage and Vehicle Data\r\nNext, we’ll try and identify the possible owners of the credit card and loyalty card by filtering the location by date and time. For the below charts, we filter the vehicle data to show the vehicle locations by hour, specifically on 6 Jan 2014. The method applied was to identify the vehicle id which was present in on the map on a specific hour and cross-reference it to the paronage dataset to identify the credit card transaction made as well as the location.\r\n\r\npreservec5106f83760aa3d8\r\n\r\n\r\npreserve3478fc4a0e0c99a9\r\n\r\nIsolated credit card transactions\r\nThe below observations using isolated cases could be made using the data from 6 Jan 14:\r\ntime (hr)\r\nVehicle ID\r\nLocation\r\nlast4ccnum\r\n9\r\n101\r\nKronos Pipe\r\n9220\r\n10\r\n101\r\nMaximum Iron\r\n9220\r\n10\r\n107\r\nNationwide Refinery\r\n9735\r\n15\r\n104\r\nAbila Airport\r\n8642\r\n20\r\n19\r\nShoppers\r\n7688\r\nThe steps above was repeated for all dates to obtain the below list of identified vehicle id, tagged to a credit card number. The rest of the data was not complete as during the process, several of the credit cards were found to be used at a shop where a different vehicle was driven instead. hence the echnique was found to be lacking in terms of the accuracy.\r\nVehicle ID\r\nlast4ccnum\r\n1\r\n2681\r\n10\r\n1321\r\n12\r\n2418\r\n13\r\n9735\r\n14\r\n5368\r\n19\r\n7688\r\n21\r\n8156\r\n24\r\n9152 1877\r\n32\r\n7688\r\n34\r\n2681\r\n35\r\n9551\r\n101\r\n9220\r\n104\r\n8642\r\n105\r\n7792\r\n107\r\n9735\r\n5.0 Future Works\r\nAs part of the future work, the network visualisation could be explored to match the credit card transactions to the vehicle id to identify the owners.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-07-11-isss608-assignment-1/isss608-assignment-1_files/figure-html5/unnamed-chunk-15-1.png",
    "last_modified": "2021-07-25T22:03:41+08:00",
    "input_file": "isss608-assignment-1.knit.md"
  }
]
